{
  "nome": "Web Engineering",
  "codice":"DT0180",
  "descrizione": {"it":"Corso di Web Engineering, Università dell'Aquila","en":"Web Engineering course, University of L'Aquila"},
  "docente": {
	"nome":"Giuseppe Della Penna",
	"url":"https://www.disim.univaq.it/GiuseppeDellaPenna",
    "email": "giuseppe.dellapenna@univaq.it",
    "ricevimento": {
      "it":"Mercoledì, 15-17",
	  "en":"Wednesday, 15-17"
    }
  },
  "obiettivi": {"it":"Il corso si propone di fornire una preparazione completa sulle tecnologie necessarie allo sviluppo di applicazioni web moderne, conformi agli standard e sicure, con particolare riguardo anche per le problematiche di accessibilità e usabilità",
  "en":"The course aims to provide a complete knowledge about the technologies required to develop modern web applications, secure and standards-compliant, with particular regard also to accessibility and usability issues"},
  "prerequisiti": {"it":"Conoscenza di base della programmazione Java","en":"Base knowledge of Java programming"},
  "lezioni":{"it":"Le lezioni sono di carattere teorico e pratico, e prevedono lo sviluppo interattivo di esempi in aula; gli studenti sono incoraggiati a partecipare alle lezioni facendo domande e discutendo le soluzioni adottate negli esempi sviluppati",
  "en":"Lectures are both theoretical and practical, and include the interactive development of examples; students are encouraged to participate to the lectures by making questions and discussing the solutions adopted in the developed examples"},
  "esame":{"it":"La valutazione finale prevede lo sviluppo (in gruppo) di un progetto e un’eventuale prova orale (individuale). Il progetto da sviluppare consiste in un’applicazione web completa. La prova orale parte dalla discussione del progetto e ha lo scopo di verificare il livello collaborazione nel gruppo e il contributo individuale al progetto","en":"The final evaluation involves the development of a project (in group) and a possible oral exam (individual). The project to be developed consists of a complete web application. The oral exam starts from the discussion of the project and aims to verify the achieved level of teamwork and the individual contribution to the project"},
  "testi": [
    {
      "autori": "Vincenzo Della Mea, Luca di Gaspero, Ivan Scagnetto",
      "titolo": "Programmazione web lato server, seconda edizione",
      "editore": "Apogeo",
      "commento": {"it":"Testo di riferimento per HTML, CSS e Javascript"},
      "lingua": "it"
    },
    {
      "autori": "Jeffrey Zeldman, Ethan Marcotte",
      "titolo": "Sviluppare Siti Con Gli Standard Web, terza edizione",
      "editore": "Apogeo",
      "commento": {"it":"Testo di riferimento sulle techiche di progettazione di siti web"},
      "lingua": "it"
    },
    {
      "autori": "Jeffrey Zeldman, Ethan Marcotte",
      "titolo": "Designing with Web Standards (3rd Edition)",
      "editore": "New Riders Press",
      "url": "http://www.amazon.com/Designing-Web-Standards-Jeffrey-Zeldman/dp/0321616952/ref=sr_1_1?ie=UTF8&qid=1301555965&sr=8-1",
      "commento":  {"en":"One of the most important course textbooks, about web design standards, is also available in English"},
       "lingua": "en"
    }
  ],
  "sillabo": [
{"peso":4,"argomenti":[
      {
        "all": "Web Standards"
      },
      {
        "it": "Accessibilità e  Usabilità: cosa significano e come si realizzano",
        "en": "Accessibility and Usability: what they mean and how can be obtained"
      },
      {
        "all": "Web Content Accessibility Guidelines (WCAG)"
      },
      {
        "it": "XML e i linguaggi markup",
        "en": "XML and markup languages"
      }
  ]},
{"peso":6,"argomenti":[
      {
        "it": "Struttura dei contenuti web: HTML4, XHTML1, HTML5",
        "en": "Structure of web contents: HTML4, XHTML1, HTML5"
      },
      {
        "it": "Uso corretto dell'HTML e accorgimenti per la compatibilità crossbrowser",
        "en": "Proper use of HTML and tips for crossbrowser compatibility"
      },
      {
        "it": "Creazione di HTML accessibile. Accessibilità nelle Rich Internet Applications (RIA)",
        "en": "Creating accessible HTML. Accessibility in Rich Internet Applications (RIA)"
      },
      {
        "it": "Validazione dei contenuti web",
        "en": "Web content validation"
      }
     ]},
{"peso":4,"argomenti":[
      {
        "it": "Presentazione dei contenuti web: CSS2 e CSS3",
        "en": "Presentation of web contents: CSS2 and CSS3"
      },
      {
        "it": "Uso corretto dei fogli di style e accorgimenti per la compatibilità crossbrowser",
        "en": "Proper use of style sheets and tips for crossbrowser compatibility"
      },
      {
        "it": "Creazione di fogli di stile degradanti",
        "en": "Creating gracefully degrading  style sheets"
      }
    ]},
{"peso":4,"argomenti":[
      {
        "it": "Creazione di layout web con i fogli di stile: tecniche di base",
        "en": "Creating web layouts with style sheets: basic techniques"
      },
      {
        "all": "Responsive design"
      }
     ]},
{"peso":20,"argomenti":[
      {
        "it": "Logica per i contenuti web, lato server: Java Servlets",
        "en": "Logic for web contents, server-side: Java Servlets"
      },
      {
        "it": "Gestione delle sessioni nelle applicazioni web Java",
        "en": "Session management in Java web applications"
      },
      {
        "it": "Database nelle applicazioni web Java: JDBC, connection pooling",
        "en": "Database in Java web applications: JDBC, connection pooling"
      },
      {
        "it": "Generazione dinamica dei contenuti: template engines per Java",
        "en": "Dynamic content generation: template engines for Java"
      },
      {
        "it": "Sicurezza delle applicazioni web: accorgimenti lato server",
        "en": "Web application security: server-side techniques"
      }
     ]},
{"peso":10,"argomenti":[
      {
        "it": "Logica per i contenuti web, lato client: Javascript",
        "en": "Logic for web contents, client side: Javascript"
      },
      {
        "it": "Javascript come linguaggio di programmazione object-oriented",
        "en": "Javascript as a object-oriented programming language"
      },
      {
        "it": "Il Document Object Model di HTML",
        "en": "The HTML Document Object Model"
      },
      {
        "it": "Il Document Object Model dei CSS",
        "en": "The CSS Document Object Model"
      },
      {
        "it": "Il modello degli eventi HTML",
        "en": "The HTML Event Model"
      },
      {
        "it": "Manipolazione del DOM con Javascript",
        "en": "DOM manipulation with JavaScript"
      },
      {
        "it": "Rich User Interaction degradante con Javascript e CSS",
        "en": "Gracefully degrading Rich User Interaction with Javascript and CSS"
      },
      {
        "all": "AJAX"
      }
     ]}
  ]  
}
